jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
#include "basetype.h"
#include "vavahal.h"
#include "cc1310upgrade.h"

#define false			0
#define true			1
#define FALSE			0
#define TRUE			1
#define bool			int
#define HI_FAILURE      -1 
#define HI_SUCCESS		0

typedef unsigned int    HI_U32; 
typedef int 			HI_S32;
typedef unsigned char	HI_U8;

///////////////////////////1310 upgrade
#define UPGRADE_ARR_SIZE            		(128*1024)
static char *pArrBuf = NULL;

#define SBL_MAX_DEVICES             		20
#define SBL_DEFAULT_RETRY_COUNT     		1
#define SBL_DEFAULT_READ_TIMEOUT    		100 // in ms
#define SBL_DEFAULT_WRITE_TIMEOUT   		200 // in ms

#define SBL_CC2650_PAGE_ERASE_SIZE          4096
#define SBL_CC2650_FLASH_START_ADDRESS      0x00000000
#define SBL_CC2650_RAM_START_ADDRESS        0x20000000
#define SBL_CC2650_ACCESS_WIDTH_32B         1
#define SBL_CC2650_ACCESS_WIDTH_8B          0
#define SBL_CC2650_PAGE_ERASE_TIME_MS       20
#define SBL_CC2650_MAX_BYTES_PER_TRANSFER   252
#define SBL_CC2650_MAX_MEMWRITE_BYTES		247
#define SBL_CC2650_MAX_MEMWRITE_WORDS		61
#define SBL_CC2650_MAX_MEMREAD_BYTES		253
#define SBL_CC2650_MAX_MEMREAD_WORDS		63
#define SBL_CC2650_FLASH_SIZE_CFG           0x4003002C
#define SBL_CC2650_RAM_SIZE_CFG             0x40082250
#define SBL_CC2650_BL_CONFIG_PAGE_OFFSET    0xFDB
#define SBL_CC2650_BL_CONFIG_ENABLED_BM     0xC5
#define SBL_CC2650_BL_WORK_MEMORY_START		0x20000000
#define SBL_CC2650_BL_WORK_MEMORY_END		0x2000016F
#define SBL_CC2650_BL_STACK_MEMORY_START	0x20000FC0
#define SBL_CC2650_BL_STACK_MEMORY_END		0x20000FFF

typedef enum {
    SBL_SUCCESS = 0,
    SBL_ERROR,
    SBL_ARGUMENT_ERROR,
    SBL_TIMEOUT_ERROR,
    SBL_PORT_ERROR,
    SBL_ENUM_ERROR,
    SBL_UNSUPPORTED_FUNCTION,
}tSblStatus;

enum {
	CMD_PING			 = 0x20,
	CMD_DOWNLOAD		 = 0x21,
	CMD_GET_STATUS		 = 0x23,
	CMD_SEND_DATA		 = 0x24,
	CMD_RESET			 = 0x25,
	CMD_SECTOR_ERASE	 = 0x26,
	CMD_CRC32			 = 0x27,
	CMD_GET_CHIP_ID 	 = 0x28,
	CMD_MEMORY_READ 	 = 0x2A,
	CMD_MEMORY_WRITE	 = 0x2B,
	CMD_BANK_ERASE		 = 0x2C,
	CMD_SET_CCFG		 = 0x2D,
};

/* Early samples had different command IDs */
enum
{
	REV1_CMD_BANK_ERASE   = 0x2A,
	REV1_CMD_SET_CCFG	  = 0x2B,
	REV1_CMD_MEMORY_READ  = 0x2C,
	REV1_CMD_MEMORY_WRITE = 0x2D,
};

enum {
	CMD_RET_SUCCESS 	 = 0x40,
	CMD_RET_UNKNOWN_CMD  = 0x41,
	CMD_RET_INVALID_CMD  = 0x42,
	CMD_RET_INVALID_ADR  = 0x43,
	CMD_RET_FLASH_FAIL	 = 0x44,
};

#define UPGRADE_UF_START 0
#define UPGRADE_UF_LEN 1
#define UPGRADE_UF_CMD 2
#define UPGRADE_UF_DATA 3
#define UPGRADE_UF_MAX_LEN 50

/// Struct used when splitting long transfers
typedef struct {
    HI_U32 startAddr;
    HI_U32 byteCount;
    HI_U32 startOffset;
    bool     bExpectAck;
}tTransfer;

static HI_U32 m_deviceId;
static HI_U32 m_deviceRev;
static bool		m_bCommInitialized;
static int32_t 	m_lastDeviceStatus;
static HI_U32	m_flashSize;
static HI_U32	m_ramSize;

static int uartX_fd = -1;

static int rfup_FormatRate(int rate)
{
	int outrate = 0;
	
	switch(rate)
	{
		case 1200:      
			outrate = B1200; 
			break;
		case 1800:
			outrate = B1800;
			break;
		case 2400:
			outrate = B2400;
			break;
		case 4800:
			outrate = B4800;
			break;
		case 9600:
			outrate = B9600;
			break;
		case 19200:
			outrate = B19200;
			break;
		case 38400:
			outrate = B38400;
			break;
		case 115200:
			outrate = B115200;
			break;
		default:
			outrate = B115200;
			break;		
	}
	
	return outrate;
}

static int rfup_SetRate(int outrate)
{
	struct termios Opt;
	
	if(uartX_fd == -1)
	{
		return -1;
	}
	
	tcgetattr(uartX_fd, &Opt);   
	cfsetispeed(&Opt, outrate);      
	cfsetospeed(&Opt, outrate);
	tcsetattr(uartX_fd, TCSAFLUSH, &Opt);  
	
	return 0;
}

static int rfup_SetParam(unsigned int Rate, unsigned char DataBit, unsigned char StopBit, unsigned char CheckBit)
{
	struct termios options;

	if(uartX_fd == -1)
	{
		return -1;
	}

	tcgetattr(uartX_fd, &options);
	options.c_oflag &= ~OPOST;  
	options.c_cflag &= ~CSIZE;

	switch(DataBit)
	{
		case 5:
			options.c_cflag |= CS5;
			break;
		case 6:
			options.c_cflag |= CS6;
			break;
		case 7:
			options.c_cflag |= CS7;
			break;
		case 8:
			options.c_cflag |= CS8;
			break;
		default:
			RFUP_PRINT("rfup_SetParam: param invalid");
			return -1;
	}

	switch(StopBit)
	{
		case 1:
			options.c_cflag &= ~(CSTOPB);
			break;
		case 2:
			options.c_cflag |= CSTOPB;
			break;
		default:
			RFUP_PRINT("rfup_SetParam: param invalid");
			return -1;
	}

	switch(CheckBit)
	{
		case 0:
			options.c_iflag &= ~(INPCK | ISTRIP);
			options.c_cflag &= ~PARENB;
			options.c_cflag &= ~PARODD;	
			break;
		case 1:
			options.c_iflag |= (INPCK | ISTRIP);
			options.c_cflag |= PARENB;            //有校验位
			options.c_cflag |= PARODD;		      //奇校验
			break;
		case 2:
			options.c_iflag |= (INPCK | ISTRIP);  
			options.c_cflag |= PARENB; 
			options.c_cflag &= ~PARODD;           //偶校验
			break;
		default:
			RFUP_PRINT("rfup_SetParam: param invalid");
			return -1;
	}

	options.c_lflag = 0; 
	options.c_iflag = 0;
	options.c_oflag = 0;

	if(tcsetattr(uartX_fd, TCSANOW, &options) < 0)
	{
		RFUP_PRINT("rfup_SetParam: tcsetattr err\n");
		return -1;
	}
	
	if(rfup_SetRate(rfup_FormatRate(Rate)) < 0)
	{
		RFUP_PRINT("rfup_SetParam: set rate err\n");
		return -1;
	}	

	return 0;
}

static void rfup_DeInit()
{
	if(uartX_fd != -1)
	{
		close(uartX_fd);
		uartX_fd = -1;	
	}

	return;
}

static int rfup_InitUart(int num, unsigned int rate)
{
	int ret;
	char uart_name[12];

	memset(uart_name, 0, 12);
	sprintf(uart_name, "/dev/ttyS%d", num);

	uartX_fd = open(uart_name, O_RDWR | O_NOCTTY | O_NDELAY, 0);
	if(uartX_fd < 0)
	{
		return -1;
	}

	fcntl(uartX_fd, F_SETFL, 0);

	ret = rfup_SetParam(rate, 8, 1, 0);
	if(ret < 0)
	{
		rfup_DeInit();
		
		RFUP_PRINT("rfup_InitUart: rfup_SetParam fail\n");
		return -1;
	}

	return 0;
}

int min(HI_U32 a, HI_U32 b)
{
	return (a > b ? b : a);
}

int Upgrade_UART_Send_Data(HI_S32 fd, HI_U8* sbuf)
{
    int ret, i;

    //防止mcu丢失host发过来的消息。300us为mcu处理一次接受usart消息中断的最长时间
    for (i = 0; i < sbuf[0]; i++){
        ret = write(fd, &sbuf[i], 1);
        //udelay(300);
        usleep(300);
        if (ret != 1)
        {
            RFUP_PRINT("write %d fd return %d\n", fd, ret);
            return -1;
        }
    }

