jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
    //RFUP_PRINT("uart send ok!\n");
    return 0;
}

int Upgrade_UART_Send_Data_Only(HI_S32 fd, HI_U8* sbuf)
{
    int ret, i;
	//RFUP_PRINT("Upgrade_UART_Send_Data_Only %x %x\n",sbuf[0],sbuf[1]);
    //防止mcu丢失host发过来的消息。300us为mcu处理一次接受usart消息中断的最长时间
    for (i = 0/*1*/; i < 2/*sbuf[0]*/; i++){
        ret = write(fd, &sbuf[i], 1);
        //usleep(300);
        if (ret != 1)
        {
            RFUP_PRINT("write %d fd return %d\n", fd, ret);
            return -1;
        }
    }

    //RFUP_PRINT("uart send ok!\n");
    return 0;
}

HI_U32 getFlashSize() { return m_flashSize; }  
HI_U32 getRamSize() { return m_ramSize; }

static HI_U32 getDeviceRev(HI_U32 deviceId)
{
    HI_U32 tmp = deviceId >> 28;
    switch(tmp)
    {
        // Early samples (Rev 1)
    case 0:
    case 1:
        return 1;
    default: 
        return 2;
    }
}

HI_U32 convertCmdForEarlySamples(HI_U32 ui32Cmd)
{
    if(m_deviceRev != 1)
    {
        // No conversion needed, return early.
        return ui32Cmd;
    }
    switch(ui32Cmd)
    {
    case CMD_MEMORY_READ: 
        return REV1_CMD_MEMORY_READ;
    case CMD_MEMORY_WRITE:
        return REV1_CMD_MEMORY_WRITE;
    case CMD_SET_CCFG:
        return REV1_CMD_SET_CCFG;
    case CMD_BANK_ERASE:
        return REV1_CMD_BANK_ERASE;
    default: 
        // No conversion needed, return original commad.
        return ui32Cmd;
    }
}


HI_U8 generateCheckSum(HI_U32 ui32Cmd, const char *pcData, HI_U32 ui32DataLen)
{
	HI_U32 i;
    HI_U8 ui8CheckSum = (HI_U8)ui32Cmd;
    for(i = 0; i < ui32DataLen; i++)
    {
        ui8CheckSum += pcData[i];
    }
    return ui8CheckSum;
}

HI_U32 sendCmd(HI_U32 ui32Cmd, const char *pcSendData/* = NULL*/, HI_U32 ui32SendLen/* = 0*/)
{
	static int showcount = 0;;
	
	if(uartX_fd < 0)
	{
		return 1;
	}
	
	ui32Cmd = convertCmdForEarlySamples(ui32Cmd);

	unsigned char pktLen = ui32SendLen + 3;
	memset(pArrBuf, 0, UPGRADE_ARR_SIZE);
    unsigned char pktSum = generateCheckSum(ui32Cmd, pcSendData, ui32SendLen);
	
	pArrBuf[0] = pktLen;
    pArrBuf[1] = pktSum;
    pArrBuf[2] = (unsigned char)ui32Cmd;

    if(ui32SendLen)
    {
        memcpy(&pArrBuf[3], pcSendData, ui32SendLen);
    }
	
	Upgrade_UART_Send_Data(uartX_fd,(HI_U8*)pArrBuf);

	showcount++;
	if(showcount++ >= 60)
	{
		RFUP_PRINT("RF upgrading...\n");
		showcount = 0;
	}

    return SBL_SUCCESS;
}

HI_U32 getCmdResponse(bool *bAck, HI_U32 ui32MaxRetries/* = SBL_DEFAULT_RETRY_COUNT*/, bool bQuietTimeout/* = false*/)
{
    unsigned char pIn[2];
    memset(pIn, 0, 2);
    HI_U32 numBytes = 0;
    HI_U32 retry = 0;
    *bAck = false;
    HI_U32 bytesRecv = 0;

	if(uartX_fd < 0)
	{
		return 1;
	}

    //
    // Expect 2 bytes (ACK or NAK)
    //
    do 
    {
		numBytes = read(uartX_fd, pIn, 2);
		
        bytesRecv += numBytes;
		
		//setState(SBL_ERROR, "readBytes numBytes=%d bytesRecv=%d\n", numBytes,bytesRecv);
		//RFUP_PRINT("readBytes numBytes=%d\n", numBytes);
        retry++;
    }
    while((bytesRecv < 2) && (retry < ui32MaxRetries));

    if(bytesRecv < 2)
    {
        if(!bQuietTimeout) RFUP_PRINT("Timed out waiting for ACK/NAK. No response from device.\n");
        return SBL_TIMEOUT_ERROR;
    }
    else
    {
        if(pIn[0] == 0x00 && pIn[1] == 0xCC)
        {
			//RFUP_PRINT("pIn[0]=0x00  pIn[1]=0xCC\n");
            *bAck = true;
            return (SBL_SUCCESS);
        }
        else if(pIn[0] == 0x00 && pIn[1] == 0x33)
        {
			//RFUP_PRINT("pIn[0]=0x00  pIn[1]=0x33\n");
            return (SBL_SUCCESS);
        }
        else
        {
            RFUP_PRINT("ACK/NAK not received. Expected 0x00 0xCC or 0x00 0x33, received 0x%02X 0x%02X.\n", pIn[0], pIn[1]);
            return SBL_ERROR;
        }
    }
    return SBL_ERROR;
}

//-----------------------------------------------------------------------------
/** \brief Send auto baud.
 *
 * \param[out] bBaudSetOk
 *      True if response is ACK, false otherwise
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 sendAutoBaud(bool *bBaudSetOk)
{
    *bBaudSetOk = false;
    //
    // Send 0x55 0x55 and expect ACK
    //
    char pData[2];
    memset(pData, 0x55, 2);
    //if(m_pCom->writeBytes(pData, 2) != 2)
    //if(m_pCom->writeBytes(pData, 2) != 2)
    
    RFUP_PRINT("sendAutoBaud\n");
	#if 0
    unsigned char pktLen = 3; 
	char sendBuf[pktLen];
    //unsigned char pktSum = generateCheckSum(ui32Cmd, pcSendData, ui32SendLen);

	memset(sendBuf,0,pktLen);
    sendBuf[0] = pktLen;
    //sendBuf[1] = pktSum;
    //sendBuf[2] = (unsigned char)ui32Cmd;
	
    memcpy(&sendBuf[1], pData, 2);
	#endif
	
	if(Upgrade_UART_Send_Data_Only(uartX_fd, (HI_U8*) pData))
    {
        RFUP_PRINT("Communication init failed. Failed to send data.\n");
        return SBL_PORT_ERROR;
    }

    if(getCmdResponse(bBaudSetOk, 2, true) != SBL_SUCCESS)
    {
        // No response received. Invalid baud rate?
        RFUP_PRINT("No response from device. Device may not be in bootloader mode. Reset device and try again.\nIf problem persists, check connection and baud rate.\n");
        return SBL_PORT_ERROR;
    }

    return SBL_SUCCESS;
}

HI_U32 ping()
{
    int retCode = SBL_SUCCESS;
    bool bResponse = false;
#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
#endif
    //
    // Send command
    //
    if((retCode = sendCmd(CMD_PING,NULL,0)) != SBL_SUCCESS)
    {
        return retCode;
    }

    //
    // Get response
    //
    if((retCode = getCmdResponse(&bResponse,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
    {
        return retCode;
    }

    return (bResponse) ? SBL_SUCCESS : SBL_ERROR;
}

//-----------------------------------------------------------------------------
/** \brief This function reset the device. Communication to the device must be 
 *      reinitialized after calling this function.
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 reset()
{
    int retCode = SBL_SUCCESS;
    bool bSuccess = false;
	#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
	#endif
	RFUP_PRINT("before reset cmd\n");
    //
    // Send command
    //
    if((retCode = sendCmd(CMD_RESET,NULL,0)) != SBL_SUCCESS)
    {
        return retCode;        
    }
	RFUP_PRINT("after reset cmd\n");
    //
    // Receive command response (ACK/NAK)
    //
    if((retCode = getCmdResponse(&bSuccess,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
    {
        return retCode;
    }
    if(!bSuccess)
    {
        RFUP_PRINT("Reset command NAKed by device.\n");
        return SBL_ERROR;
    }

    m_bCommInitialized = false;
    return SBL_SUCCESS;
}

