jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
//-----------------------------------------------------------------------------
/** \brief Utility function for splitting 32 bit variable into char array
 *      (4 elements). Data are converted MSB, that is, \e pcDst[0] is the
 *      most significant byte.
 *
 * \param[in] ui32Src
 *      The 32 bit variable to convert.
 *
 * \param[out] pcDst
 *      Pointer to the char array where the data will be stored.
 *
 * \return
 *      void
 */
//-----------------------------------------------------------------------------
/*static */void ulToCharArray(const HI_U32 ui32Src, char *pcDst)
{
    // MSB first
    pcDst[0] =  (HI_U8)(ui32Src >> 24);
    pcDst[1] =  (HI_U8)(ui32Src >> 16);
    pcDst[2] =  (HI_U8)(ui32Src >> 8);
    pcDst[3] =  (HI_U8)(ui32Src >> 0);
}

bool addressInBLWorkMemory(HI_U32 ui32StartAddress, HI_U32 ui32ByteCount/* = 1*/)
{
    HI_U32 ui32EndAddr = ui32StartAddress + ui32ByteCount;

	if(ui32StartAddress <= SBL_CC2650_BL_WORK_MEMORY_END)
	{
		return true;
	}
	if((ui32StartAddress >= SBL_CC2650_BL_STACK_MEMORY_START) && 
	   (ui32StartAddress <= SBL_CC2650_BL_STACK_MEMORY_END))
	{
		return true;
	}
	if((ui32EndAddr >= SBL_CC2650_BL_STACK_MEMORY_START) && 
	   (ui32EndAddr <= SBL_CC2650_BL_STACK_MEMORY_END))
	{
		return true;
	}
	return false;
}

HI_U32 writeMemory32(HI_U32 ui32StartAddress, HI_U32 ui32UnitCount, const HI_U32 *pui32Data)
{
	HI_U32 i;
	HI_U32 j;
    HI_U32 retCode = SBL_SUCCESS;
    bool bSuccess = false;
    
    //
    // Check input arguments
    //
    if((ui32StartAddress & 0x03))
    {
        RFUP_PRINT("writeMemory32(): Start address (0x%08X) must 4 byte aligned.\n", ui32StartAddress);
        return SBL_ARGUMENT_ERROR;
    }
	if(addressInBLWorkMemory(ui32StartAddress, ui32UnitCount * 4))
	{
		// Issue warning
		RFUP_PRINT("writeMemory32(): Writing to bootloader work memory/stack:\n(0x%08X-0x%08X, 0x%08X-0x%08X)\n",
			         SBL_CC2650_BL_WORK_MEMORY_START,SBL_CC2650_BL_WORK_MEMORY_END, SBL_CC2650_BL_STACK_MEMORY_START,SBL_CC2650_BL_STACK_MEMORY_END);
		return SBL_ARGUMENT_ERROR;
	}
	#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
	#endif
	HI_U32 chunkCount = (ui32UnitCount / SBL_CC2650_MAX_MEMWRITE_WORDS);
	if(ui32UnitCount % SBL_CC2650_MAX_MEMWRITE_WORDS) chunkCount++;
	HI_U32 remainingCount = ui32UnitCount;
	//char* pcPayload = new char[5 + (SBL_CC2650_MAX_MEMWRITE_WORDS*4)];
	char* pcPayload = (char*)malloc((5 + (SBL_CC2650_MAX_MEMWRITE_WORDS*4))*sizeof(char));
	if(pcPayload == NULL)
	{
		
        return SBL_ARGUMENT_ERROR;
	}

	for(i = 0; i < chunkCount; i++)
	{
		HI_U32 chunkOffset = i * SBL_CC2650_MAX_MEMWRITE_WORDS;
		HI_U32 chunkStart  = ui32StartAddress + (chunkOffset * 4);
		HI_U32 chunkSize   = min(remainingCount, SBL_CC2650_MAX_MEMWRITE_WORDS);
		remainingCount -= chunkSize;

		//
		// Build payload
		// - 4B address (MSB first)
		// - 1B access width
		// - 1-SBL_CC2650_MAX_MEMWRITE_WORDS data (MSB first)
		//
		ulToCharArray(chunkStart, &pcPayload[0]);
		pcPayload[4] = SBL_CC2650_ACCESS_WIDTH_32B;
		for(j = 0; j < chunkSize; j++)
		{
			ulToCharArray(pui32Data[j + chunkOffset], &pcPayload[5 + j*4]);
		}

		//
		// Set progress
		//
		//setProgress( ((i * 100) / chunkCount) );

		//
		// Send command
		//
		if((retCode = sendCmd(CMD_MEMORY_WRITE, pcPayload, 5 + chunkSize*4)) != SBL_SUCCESS)
		{
			return retCode;        
		}

		//
		// Receive command response (ACK/NAK)
		//
		//if((retCode = getCmdResponse(bSuccess, 5)) != SBL_SUCCESS)
		if((retCode = getCmdResponse(&bSuccess, 5,false)) != SBL_SUCCESS)
		{
			return retCode;
		}
		if(!bSuccess)
		{
			RFUP_PRINT("writeMemory32(): Device NAKed command for address 0x%08X.\n", chunkStart);
			return SBL_ERROR;
		}
	}
    
    //
    // Set progress
    //
	//setProgress(100);

	//
	// Cleanup
	//
    //delete [] pcPayload;

    free(pcPayload);
    return SBL_SUCCESS;
}

bool addressInFlash(HI_U32 ui32StartAddress, HI_U32 ui32ByteCount/* = 1*/)
{
    HI_U32 ui32EndAddr = ui32StartAddress + ui32ByteCount;

    if(ui32StartAddress < SBL_CC2650_FLASH_START_ADDRESS)
    {
        return false;
    }
    if(ui32EndAddr > (SBL_CC2650_FLASH_START_ADDRESS + getFlashSize()))
    {
        return false;
    }
    
    return true;
}

//-----------------------------------------------------------------------------
/** \brief Utility function for converting 4 elements in char array into
 *      32 bit variable. Data are converted MSB, that is. \e pcSrc[0] is the
 *      most significant byte.
 *
 * \param pcSrc[in]
 *      A pointer to the source array.
 *
 * \return
 *      Returns the 32 bit variable.
 */
//-----------------------------------------------------------------------------
/*static */HI_U32 charArrayToUL(const char *pcSrc)
{
    HI_U32 ui32Val = (unsigned char)pcSrc[3];
    ui32Val += (((unsigned long)pcSrc[2]) & 0xFF) << 8;
    ui32Val += (((unsigned long)pcSrc[1]) & 0xFF) << 16;
    ui32Val += (((unsigned long)pcSrc[0]) & 0xFF) << 24;
    return (ui32Val);
}

//-----------------------------------------------------------------------------
/** \brief Send command response (ACK/NAK).
 *
 * \param[in] bAck
 *      True if response is ACK, false if response is NAK.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 sendCmdResponse(bool bAck)
{

    char pData[2];
    pData[0] = 0x00;
    pData[1] = (bAck) ? 0xCC : 0x33;

	/////////////////////////
	#if 0
    unsigned char pktLen = 3; 
	char sendBuf[pktLen];//={0};
    //unsigned char pktSum = generateCheckSum(ui32Cmd, pcSendData, ui32SendLen);

	memset(sendBuf,0,pktLen);
    sendBuf[0] = pktLen;
    //sendBuf[1] = pktSum;
    //sendBuf[2] = (unsigned char)ui32Cmd;
	
    memcpy(&sendBuf[1], pData, 2);
	#endif
	
	if(Upgrade_UART_Send_Data_Only(uartX_fd, (HI_U8*) pData))
    {
        RFUP_PRINT("Failed to send ACK/NAK response over\n");
        return SBL_PORT_ERROR;
    }


	/////////////////////////
    #if 0
    if(m_pCom->writeBytes(pData, 2) != 2)
    {
        RFUP_PRINT("Failed to send ACK/NAK response over\n");
        return SBL_PORT_ERROR;
    }
	#endif
    return SBL_SUCCESS;
}

