jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
bool addressInRam(HI_U32 ui32StartAddress, HI_U32 ui32ByteCount/* = 1*/)
{
    HI_U32 ui32EndAddr = ui32StartAddress + ui32ByteCount;

    if(ui32StartAddress < SBL_CC2650_RAM_START_ADDRESS)
    {
        return false;
    }
    if(ui32EndAddr > (SBL_CC2650_RAM_START_ADDRESS + getRamSize()))
    {
        return false;
    }
    return true;
}

//-----------------------------------------------------------------------------
/** \brief Get response data from device.
 *
 * \param[out] pcData
 *      Pointer to where received data will be stored.
 * \param[in|out] ui32MaxLen
 *      Max number of bytes that can be received. Is populated with the actual
 *      number of bytes received.
 * \param[in] ui32MaxRetries (optional)
 *      How many times ComPort::readBytes() can time out before fail is issued.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
unsigned int getResponseData(char *pcData, unsigned int *ui32MaxLen)
{
    unsigned int retry = 0;
    unsigned char pcHdr[2];
    unsigned int numPayloadBytes;
    HI_U8 hdrChecksum, dataChecksum;
    unsigned int bytesRecv = 0;
	unsigned int ui32MaxLenCalcu = *ui32MaxLen;
	int ui32MaxRetries =1;

    
    //
    // Read length and checksum
    //
    memset(pcHdr, 0, 2);
    do
    {
        //bytesRecv += m_pCom->readBytes(&pcHdr[bytesRecv], (2-bytesRecv));
		bytesRecv += read(uartX_fd, &pcHdr[bytesRecv], (2-bytesRecv));
        retry ++;
    }
    while((bytesRecv < 2) && retry < ui32MaxRetries);

    //
    // Check that we've received 2 bytes
    //
    if(bytesRecv < 2)
    {
        RFUP_PRINT("Timed out waiting for data header from device.\n");
        return SBL_TIMEOUT_ERROR;
    }
    numPayloadBytes = pcHdr[0]-2;
    hdrChecksum = pcHdr[1];

    //
    // Check if length byte is too long.
    //
    if(numPayloadBytes > ui32MaxLenCalcu/*ui32MaxLen*/)
    {
        RFUP_PRINT("Error: Device sending more data than expected. \nMax expected was %d, sent was %d.\n", (HI_U32)ui32MaxLenCalcu, (numPayloadBytes+2));
        //m_pCom->flushBuffers();
        return SBL_ERROR;
    }

    //
    // Read the payload data
    //
    bytesRecv = 0;
    do 
    {
        //bytesRecv += m_pCom->readBytes(&pcData[bytesRecv], (numPayloadBytes-bytesRecv));

		bytesRecv += read(uartX_fd, &pcData[bytesRecv], (numPayloadBytes-bytesRecv));
        retry++;
    }
    while(bytesRecv < numPayloadBytes && retry < ui32MaxRetries);

    //
    // Have we received what we expected?
    //
    if(bytesRecv < numPayloadBytes)
    {
        *ui32MaxLen = bytesRecv;
        RFUP_PRINT("Timed out waiting for data from device.\n");
        return SBL_TIMEOUT_ERROR;
    }

    //
    // Verify data checksum
    //
    dataChecksum = generateCheckSum(0, pcData, numPayloadBytes);
    if(dataChecksum != hdrChecksum)
    {
        RFUP_PRINT("Checksum verification error. Expected 0x%02X, got 0x%02X.\n", hdrChecksum, dataChecksum);
        return SBL_ERROR;
    }

    *ui32MaxLen = bytesRecv;
    return SBL_SUCCESS;
}

HI_U32 calculateCrc32(HI_U32 ui32StartAddress, HI_U32 ui32ByteCount, HI_U32 *pui32Crc)
{
    HI_U32 retCode = SBL_SUCCESS;
    bool bSuccess = false;
    char pcPayload[12];
    HI_U32 ui32RecvCount = 0;

    //
    // Check input arguments
    //
    if(!addressInFlash(ui32StartAddress, ui32ByteCount) &&
       !addressInRam(ui32StartAddress, ui32ByteCount))
    {
        RFUP_PRINT("Specified address range (0x%08X + %d bytes) is not in device FLASH nor RAM.\n", ui32StartAddress, ui32ByteCount);
        return SBL_ARGUMENT_ERROR;
    }
#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
#endif

    //
    // Set progress
    //
    //setProgress(0);

    //
    // Build payload
    // - 4B address (MSB first)
    // - 4B byte count(MSB first)
    //
    ulToCharArray(ui32StartAddress, &pcPayload[0]);
    ulToCharArray(ui32ByteCount, &pcPayload[4]);
    pcPayload[8] = 0x00;
    pcPayload[9] = 0x00;
    pcPayload[10] = 0x00;
    pcPayload[11] = 0x00;
    //
    // Send command
    //
    if((retCode = sendCmd(CMD_CRC32, pcPayload, 12)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Receive command response (ACK/NAK)
    //
    //if((retCode = getCmdResponse(bSuccess, 5)) != SBL_SUCCESS)
	if((retCode = getCmdResponse(&bSuccess, 5, false)) != SBL_SUCCESS)
    {
        return retCode;
    }
    if(!bSuccess)
    {
        RFUP_PRINT("Device NAKed CRC32 command.\n");
        return SBL_ERROR;
    }

    //
    // Get data response
    //
    ui32RecvCount = 4;
    if((retCode = getResponseData(pcPayload, &ui32RecvCount)) != SBL_SUCCESS)
    {
        sendCmdResponse(false);
        return retCode;
    }
    *pui32Crc = charArrayToUL(pcPayload);

    //
    // Send ACK/NAK to command
    //
    bool bAck = (ui32RecvCount == 4) ? true : false;
    sendCmdResponse(bAck);

    //
    // Set progress
    //
    //setProgress(100);

    return SBL_SUCCESS;
}


//-----------------------------------------------------------------------------
/** \brief Erases all customer accessible flash sectors not protected by FCFG1
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 eraseFlashBank()
{
    int retCode = SBL_SUCCESS;
    bool bResponse = false;
#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
#endif

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_BANK_ERASE,NULL,0)) != SBL_SUCCESS)
    {
        return retCode;
    }

    //
    // Get response
    //
    if((retCode = getCmdResponse(&bResponse,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
    {
        return retCode;
    }

    return (bResponse) ? SBL_SUCCESS : SBL_ERROR;
}


//-----------------------------------------------------------------------------
/** \brief Writes the CC26xx defined CCFG fields to the flash CCFG area with
 *      the values received in the data bytes of this command.
 *
 * \param[in] ui32Field
 *      CCFG Field ID which identifies the CCFG parameter to be written.
 * \param[in] ui32FieldValue
 *      Field value to be programmed.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------

HI_U32 setCCFG(HI_U32 ui32Field, HI_U32 ui32FieldValue){
    int retCode = SBL_SUCCESS;
    bool bSuccess = false;
#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
#endif

    //
    // Generate payload
    // - 4B Field ID
    // - 4B Field value
    //
    char pcPayload[8];
    ulToCharArray(ui32Field, &pcPayload[0]);
    ulToCharArray(ui32FieldValue, &pcPayload[4]);

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_SET_CCFG, pcPayload, 8)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Receive command response (ACK/NAK)
    //
    //if((retCode = getCmdResponse(bSuccess)) != SBL_SUCCESS)
		
	if((retCode = getCmdResponse(&bSuccess,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
    {
        return retCode;
    }
    if(!bSuccess)
    {
        RFUP_PRINT("Set CCFG command NAKed by device.\n");
        return SBL_ERROR;
    }

    
    return SBL_SUCCESS;
}

HI_U32 cmdDownload(HI_U32 ui32Address, HI_U32 ui32Size)
{
    int retCode = SBL_SUCCESS;
    bool bSuccess = false;


    //
    // Check input arguments
    //
    if(!addressInFlash(ui32Address, ui32Size))
    {
        RFUP_PRINT("Flash download: Address range (0x%08X + %d bytes) is not in device FLASH nor RAM.\n", ui32Address, ui32Size);
        return SBL_ARGUMENT_ERROR;
    }
    if(ui32Size & 0x03)
    {
        RFUP_PRINT("Flash download: Byte count must be a multiple of 4\n");
        return SBL_ARGUMENT_ERROR;
    }

    //
    // Generate payload
    // - 4B Program address
    // - 4B Program size
    //
    char pcPayload[8];
    ulToCharArray(ui32Address, &pcPayload[0]);
    ulToCharArray(ui32Size, &pcPayload[4]);

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_DOWNLOAD, pcPayload, 8)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Receive command response (ACK/NAK)
    //
    //if((retCode = getCmdResponse(bSuccess)) != SBL_SUCCESS)
    if((retCode = getCmdResponse(&bSuccess,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
    {
        return retCode;
    }

    //
    // Return command response
    //
    return (bSuccess) ? SBL_SUCCESS : SBL_ERROR;
}


