jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
//-----------------------------------------------------------------------------
/** \brief This function sends the CC2650 SendData command and handles the
 *      device response.
 *
 * \param[in] pcData
 *      Pointer to the data to send.
 * \param[in] ui32ByteCount
 *      The number of bytes to send.
 *
 * \return
 *      Returns SBL_SUCCESS if command and response was successful.
 */
//-----------------------------------------------------------------------------
HI_U32 cmdSendData(const char *pcData, HI_U32 ui32ByteCount)
{   
    HI_U32 retCode = SBL_SUCCESS;
    bool bSuccess = false;

    //
    // Check input arguments
    //
    if(ui32ByteCount > SBL_CC2650_MAX_BYTES_PER_TRANSFER)
    {
        RFUP_PRINT("Error: Byte count (%d) exceeds maximum transfer size %d.\n", ui32ByteCount, SBL_CC2650_MAX_BYTES_PER_TRANSFER);
        return SBL_ERROR;
    }

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_SEND_DATA, pcData, ui32ByteCount)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Receive command response (ACK/NAK)
    //
    //if((retCode = getCmdResponse(bSuccess, 3)) != SBL_SUCCESS)
    if((retCode = getCmdResponse(&bSuccess, 3,false)) != SBL_SUCCESS)
    {
        return retCode;
    }
    if(!bSuccess)
    {
        return SBL_ERROR;
    }

    return SBL_SUCCESS;
}

//-----------------------------------------------------------------------------
/** \brief This function returns the page within which address \e ui32Address
 *      is located.
 *
 * \param[in] ui32Address
 *      The address.
 *
 * \return
 *      Returns the flash page within which an address is located.
 */
//-----------------------------------------------------------------------------
HI_U32 addressToPage(HI_U32 ui32Address)
{
    return ((ui32Address - SBL_CC2650_FLASH_START_ADDRESS) / SBL_CC2650_PAGE_ERASE_SIZE);
}

//-----------------------------------------------------------------------------
/** \brief This function initializes connection to the CC2538 device. 
 *
 * \param[in] bSetXosc
 *      If true, try to enable device XOSC.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 initCommunication(bool bSetXosc)
{
    bool bSuccess, bBaudSetOk;
    int retCode = SBL_ERROR;
	
	if(uartX_fd < 0)
	{
		return 1;
	}

	sendAutoBaud(&bBaudSetOk);

    if(sendCmd(0, NULL, 0) != SBL_SUCCESS)
    {
        return SBL_ERROR;
    }

    //
    // Do we get a response (ACK/NAK)?
    //
    bSuccess = false;
    if(getCmdResponse(&bSuccess, SBL_DEFAULT_RETRY_COUNT, true) != SBL_SUCCESS)
    {
		retCode = sendAutoBaud(&bBaudSetOk);
        if(retCode != SBL_SUCCESS)
        {
            return retCode;
        }
    }

    return SBL_SUCCESS;
}

//-----------------------------------------------------------------------------
/** \brief This function reads device ID.
 *
 * \param[out] pui32DeviceId
 *      Pointer to where device ID is stored.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 readDeviceId(HI_U32 *pui32DeviceId)
{
    int retCode = SBL_SUCCESS;
    bool bSuccess = false;

 
    //
    // Send command
    //
    if((retCode = sendCmd(CMD_GET_CHIP_ID,NULL,0)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Receive command response (ACK/NAK)
    //
    //if((retCode = getCmdResponse(bSuccess)) != SBL_SUCCESS)
	if((retCode = getCmdResponse(&bSuccess,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
	{
        return retCode;
    }
    if(!bSuccess)
    {
        return SBL_ERROR;
    }

    //
    // Receive response data
    //
    char pId[4];
    memset(pId, 0, 4);
    HI_U32 numBytes = 4;
    if((retCode = getResponseData(pId, &numBytes)) != SBL_SUCCESS)
    {
        //
        // Respond with NAK
        //
        sendCmdResponse(false);
        return retCode;
    }

    if(numBytes != 4)
        {
            //
            // Respond with NAK
            //
            sendCmdResponse(false);
            RFUP_PRINT("Didn't receive 4 B.\n");
            return SBL_ERROR;
        }

    //
    // Respond with ACK
    //
    sendCmdResponse(true);

    //
    // Store retrieved ID and report success
    //
    *pui32DeviceId = charArrayToUL(pId);
    m_deviceId = *pui32DeviceId;

    //
    // Store device revision (used internally, see sbl_device_cc2650.h)
    //
    m_deviceRev = getDeviceRev(m_deviceId);

    return SBL_SUCCESS;
}

//-----------------------------------------------------------------------------
/** \brief This function reads \e ui32UnitCount (32 bit) words of data from 
 *      device. Destination array is 32 bit wide. The start address must be 4 
 *      byte aligned.
 *
 * \param[in] ui32StartAddress
 *      Start address in device (must be 4 byte aligned).
 * \param[in] ui32UnitCount
 *      Number of data words to read.
 * \param[out] pcData
 *      Pointer to where read data is stored.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 readMemory32(HI_U32 ui32StartAddress, HI_U32 ui32UnitCount, HI_U32 *pui32Data)
{
	HI_U32 i;
    int retCode = SBL_SUCCESS;
    bool bSuccess = false;

    //
    // Check input arguments
    //
    if((ui32StartAddress & 0x03))
    {
        RFUP_PRINT("readMemory32(): Start address (0x%08X) must be a multiple of 4.\n", ui32StartAddress);
        return SBL_ARGUMENT_ERROR;
    }

#if 0
    if(!isConnected())
    {
        return SBL_PORT_ERROR;
    }
#endif
    unsigned char pcPayload[6];
	HI_U32 responseData[SBL_CC2650_MAX_MEMREAD_WORDS];
	HI_U32 chunkCount = ui32UnitCount / SBL_CC2650_MAX_MEMREAD_WORDS;
	if(ui32UnitCount % SBL_CC2650_MAX_MEMREAD_WORDS) chunkCount++;
	HI_U32 remainingCount = ui32UnitCount;

	for(i = 0; i < chunkCount; i++)
	{
		HI_U32 dataOffset = (i * SBL_CC2650_MAX_MEMREAD_WORDS);
		HI_U32 chunkStart = ui32StartAddress + dataOffset;
		HI_U32 chunkSize  = min(remainingCount, SBL_CC2650_MAX_MEMREAD_WORDS);
		remainingCount -= chunkSize;
    
        //
        // Build payload
        // - 4B address (MSB first)
        // - 1B access width
		// - 1B Number of accesses (in words)
        //
        ulToCharArray(chunkStart, (char *)&pcPayload[0]);
        pcPayload[4] = SBL_CC2650_ACCESS_WIDTH_32B;
        pcPayload[5] = chunkSize;
		//
        // Set progress
        //
        //setProgress(((i * 100) / chunkCount));

        //
        // Send command
        //
        if((retCode = sendCmd(CMD_MEMORY_READ, (char *)pcPayload, 6)) != SBL_SUCCESS)
        {
            return retCode;
        }

        //
        // Receive command response (ACK/NAK)
        //
        //if((retCode = getCmdResponse(bSuccess)) != SBL_SUCCESS)
		if((retCode = getCmdResponse(&bSuccess, SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
        {
            return retCode;
        }
        if(!bSuccess)
        {
            return SBL_ERROR;
        }

        //
        // Receive 4B response
        //
		HI_U32 expectedBytes = chunkSize * 4;
		HI_U32 recvBytes = expectedBytes;
        if((retCode = getResponseData((char*)responseData, &recvBytes)) != SBL_SUCCESS)
        {
            //
            // Respond with NAK
            //
            sendCmdResponse(false);
            return retCode;
        }
	
		if(recvBytes != expectedBytes)
        {
            //
            // Respond with NAK
            //
            sendCmdResponse(false);
            RFUP_PRINT("Didn't receive 4 B.\n");
            return SBL_ERROR;
        }

		memcpy(&pui32Data[dataOffset], responseData, expectedBytes);
		//delete [] responseData;
        //
        // Respond with ACK
        //
        sendCmdResponse(true);
	}

    //
    // Set progress
    //
    //setProgress(100);

    return SBL_SUCCESS;
}


