jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
//-----------------------------------------------------------------------------
/** \brief This function reads device FLASH size in bytes.
 *
 * \param[out] pui32FlashSize
 *      Pointer to where FLASH size is stored.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 readFlashSize(HI_U32 *pui32FlashSize)
{
    HI_U32 retCode = SBL_SUCCESS;

    //
    // Read CC2650 DIECFG0 (contains FLASH size information)
    //
    HI_U32 addr = SBL_CC2650_FLASH_SIZE_CFG;
    HI_U32 value;
	retCode = readMemory32(addr, 1, &value);
    if(retCode != SBL_SUCCESS)
    {
        RFUP_PRINT("Failed to read device FLASH size %d\n", retCode);
        return retCode;
    }
	
    //
    // Calculate flash size (The number of flash sectors are at bits [7:0])
    //
    value &= 0xFF;
    *pui32FlashSize = value*SBL_CC2650_PAGE_ERASE_SIZE;

    m_flashSize = *pui32FlashSize;
	RFUP_PRINT("m_flashSize = %d\n",m_flashSize);
    return SBL_SUCCESS;
}



//-----------------------------------------------------------------------------
/** \brief This function reads device RAM size in bytes.
 *
 * \param[out] pui32RamSize
 *      Pointer to where RAM size is stored.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 readRamSize(HI_U32 *pui32RamSize)
{
    int retCode = SBL_SUCCESS;

    //
    // Read CC2650 DIECFG0 (contains RAM size information
    //
    HI_U32 addr = SBL_CC2650_RAM_SIZE_CFG;
    HI_U32 value;
    if((retCode = readMemory32(addr, 1, &value)) != SBL_SUCCESS)
    {
        RFUP_PRINT("Failed to read device RAM size");
        return retCode;
    }

    //
    // Calculate RAM size in bytes (Ram size bits are at bits [1:0])
    //
    value &= 0x03;
    if(m_deviceRev == 1)
    {
        // Early samples has less RAM
        switch(value)
        {
        case 3: *pui32RamSize = 0x4000; break;    // 16 KB
        case 2: *pui32RamSize = 0x2000; break;    // 8 KB
        case 1: *pui32RamSize = 0x1000; break;    // 4 KB
        case 0:                                   // 2 KB
        default:*pui32RamSize = 0x0800; break;    // All invalid values are interpreted as 2 KB
        }
    }
    else
    {
        switch(value)
        {
        case 3: *pui32RamSize = 0x5000; break;    // 20 KB
        case 2: *pui32RamSize = 0x4000; break;    // 16 KB
        case 1: *pui32RamSize = 0x2800; break;    // 10 KB
        case 0:                                   // 4 KB
        default:*pui32RamSize = 0x1000; break;    // All invalid values are interpreted as 4 KB
        }
    }
    
    //
    // Save RAM size internally
    //
    m_ramSize = *pui32RamSize;
	RFUP_PRINT("m_ramSize=%d\n",m_ramSize);
    return retCode;
}


//-----------------------------------------------------------------------------
/** \brief Connect to given port number at specified baud rate.
 *
 * \param[in] csPortNum
 *      String containing the COM port to use
 * \param[in] ui32BaudRate
 *      Baudrate to use for talking to the device.
 * \param[in] bEnableXosc (optional)
 *      If true, try to enable device XOSC. Defaults to false. This option is
 *      not available for all device types.
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 upgrade_connect(int csPortNum, HI_U32 ui32BaudRate, bool bEnableXosc/* = false*/)
{
    int retCode = SBL_SUCCESS;
   

    // Check if device is responding at the given baud rate
    if((retCode = initCommunication(bEnableXosc)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Read device ID
    //
    HI_U32 tmp;
    if((retCode = readDeviceId(&tmp)) != SBL_SUCCESS)
    {
        RFUP_PRINT("Failed to read device ID during initial connect.\n");
        return retCode;
    }
    //
    // Read device flash size
    //   
    if((retCode = readFlashSize(&tmp)) != SBL_SUCCESS)
    {
        RFUP_PRINT("Failed to read flash size during initial connect.\n");
        return retCode;
    }
    //
    // Read device ram size
    //
    if((retCode = readRamSize(&tmp)) != SBL_SUCCESS)
    {
        RFUP_PRINT("Failed to read RAM size during initial connect.\n");
        return retCode;
    }

    return SBL_SUCCESS;
}

// Calculate crc32 checksum the way CC2538 and CC2650 does it.
int calcCrcLikeChip(const unsigned char *pData, unsigned long ulByteCount)
{
    unsigned long d, ind;
    unsigned long acc = 0xFFFFFFFF;
    const unsigned long ulCrcRand32Lut[] =
    {
        0x00000000, 0x1DB71064, 0x3B6E20C8, 0x26D930AC, 
        0x76DC4190, 0x6B6B51F4, 0x4DB26158, 0x5005713C, 
        0xEDB88320, 0xF00F9344, 0xD6D6A3E8, 0xCB61B38C, 
        0x9B64C2B0, 0x86D3D2D4, 0xA00AE278, 0xBDBDF21C
    };

    while ( ulByteCount-- )
    {
        d = *pData++;
        ind = (acc & 0x0F) ^ (d & 0x0F);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
        ind = (acc & 0x0F) ^ (d >> 4);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
    }

    return (acc ^ 0xFFFFFFFF);
}

//-----------------------------------------------------------------------------
/** \brief This function gets status from device.
 *
 * \param[out] pStatus
 *      Pointer to where status is stored.
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 readStatus(HI_U32 *pui32Status)
{
    HI_U32 retCode = SBL_SUCCESS;
    bool bSuccess = false;

    //
    // Send command
    //
    if((retCode = sendCmd(CMD_GET_STATUS,NULL,0)) != SBL_SUCCESS)
    {
        return retCode;        
    }

    //
    // Receive command response
    //
    //if((retCode = getCmdResponse(bSuccess)) != SBL_SUCCESS)
    if((retCode = getCmdResponse(&bSuccess,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
    {
        return retCode;
    }

    if(!bSuccess)
    {
        return SBL_ERROR;
    }

    //
    // Receive command response data
    //
    char status = 0;
    HI_U32 ui32NumBytes = 1;
    if((retCode = getResponseData(&status, &ui32NumBytes)) != SBL_SUCCESS)
    {
        //
        // Respond with NAK
        //
        sendCmdResponse(false);
        return retCode;
    }

    //
    // Respond with ACK
    //
    sendCmdResponse(true);

    m_lastDeviceStatus = status;
    *pui32Status = status;
    return SBL_SUCCESS;
}


