jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
//-----------------------------------------------------------------------------
/** \brief This function erases device flash pages. Starting page is the page 
 *      that includes the address in \e startAddress. Ending page is the page 
 *      that includes the address <startAddress + byteCount>. CC13/CC26xx erase 
 *      size is 4KB.
 *
 * \param[in] ui32StartAddress
 *      The start address in flash.
 * \param[in] ui32ByteCount
 *      The number of bytes to erase.
 *
 * \return
 *      Returns SBL_SUCCESS, ...
 */
//-----------------------------------------------------------------------------
HI_U32 eraseFlashRange(HI_U32 ui32StartAddress, HI_U32 ui32ByteCount)
{
    HI_U32 retCode = SBL_SUCCESS;
    bool bSuccess = false;
    char pcPayload[4];
    HI_U32 devStatus;
	HI_U32 i;

    //
    // Calculate retry count
    //
    HI_U32 ui32PageCount = ui32ByteCount / SBL_CC2650_PAGE_ERASE_SIZE;
    if( ui32ByteCount % SBL_CC2650_PAGE_ERASE_SIZE) ui32PageCount ++;
    //setProgress( 0 );
    for(i = 0; i < ui32PageCount; i++)
    {

        //
        // Build payload
        // - 4B address (MSB first)
        //
        ulToCharArray(ui32StartAddress + i*(4096), &pcPayload[0]);

        //
        // Send command
        //
        if((retCode = sendCmd(CMD_SECTOR_ERASE, pcPayload, 4)) != SBL_SUCCESS)
        {
            return retCode;        
        }
		
        //
        // Receive command response (ACK/NAK)
        //
        //if((retCode = getCmdResponse(bSuccess)) != SBL_SUCCESS)
        if((retCode = getCmdResponse(&bSuccess,SBL_DEFAULT_RETRY_COUNT,false)) != SBL_SUCCESS)
        {
            return retCode;
        }
        if(!bSuccess)
        {
            return SBL_ERROR;
        }

        //
        // Check device status (Flash failed if page(s) locked)
        //
        readStatus(&devStatus);
        if(devStatus != CMD_RET_SUCCESS)
        {
            RFUP_PRINT("Flash erase failed. (Status 0x%02X). Flash pages may be locked.\n", devStatus);
            return SBL_ERROR;
        }

        //setProgress( 100*(i+1)/ui32PageCount );
    }
  

    return SBL_SUCCESS;
}

HI_U32 writeFlashRange(HI_U32 ui32StartAddress, HI_U32 ui32ByteCount, const char *pcData)
{
    HI_U32 devStatus = CMD_RET_UNKNOWN_CMD;
    HI_U32 retCode = SBL_SUCCESS;
    HI_U32 bytesLeft, dataIdx, bytesInTransfer;
    HI_U32 transferNumber = 1;
    bool bIsRetry = false;
    bool bBlToBeDisabled = false;
	HI_U32 i;
    //std::vector<tTransfer> pvTransfer;

	int s32TransNum = 0;
	tTransfer pvTransfer[2];
	memset(pvTransfer,0,sizeof(tTransfer)*2);
	
    HI_U32 ui32TotChunks = (ui32ByteCount / SBL_CC2650_MAX_BYTES_PER_TRANSFER);
    if(ui32ByteCount % SBL_CC2650_MAX_BYTES_PER_TRANSFER) ui32TotChunks++;

    //
    // Calculate BL configuration address (depends on flash size)
    //
    HI_U32 ui32BlCfgAddr = SBL_CC2650_FLASH_START_ADDRESS +                 \
                             getFlashSize() -                               \
                             SBL_CC2650_PAGE_ERASE_SIZE +                   \
                             SBL_CC2650_BL_CONFIG_PAGE_OFFSET;

    //
    // Calculate BL configuration buffer index
    //
    HI_U32 ui32BlCfgDataIdx = ui32BlCfgAddr - ui32StartAddress;

    //
    // Is BL configuration part of buffer?
    //
    if(ui32BlCfgDataIdx <= ui32ByteCount)
    {
        if(((pcData[ui32BlCfgDataIdx]) & 0xFF) != SBL_CC2650_BL_CONFIG_ENABLED_BM)
        {
            bBlToBeDisabled = false;
            RFUP_PRINT("Warning: CC2650 bootloader will be disabled.\n");
        }
    }

    if(bBlToBeDisabled)
    {
        //
        // Split into two transfers
        //
        //pvTransfer.resize(2);
        s32TransNum = 2;

        //
        // Main transfer (before lock bit)
        //
        pvTransfer[0].bExpectAck  = true;
        pvTransfer[0].startAddr   = ui32StartAddress;
        pvTransfer[0].byteCount   = (ui32BlCfgAddr - ui32StartAddress) & (~0x03);
        pvTransfer[0].startOffset = 0;

        //
        // The transfer locking the backdoor
        //
        pvTransfer[1].bExpectAck  = false;
        pvTransfer[1].startAddr   = ui32BlCfgAddr - (ui32BlCfgAddr % 4);
        pvTransfer[1].byteCount   = ui32ByteCount - pvTransfer[0].byteCount;
        pvTransfer[1].startOffset = ui32BlCfgDataIdx - (ui32BlCfgDataIdx % 4);

    }
    else
    {
        //pvTransfer.resize(1);
        s32TransNum = 1;
        pvTransfer[0].bExpectAck  = true;
        pvTransfer[0].byteCount = ui32ByteCount;
        pvTransfer[0].startAddr = ui32StartAddress;
        pvTransfer[0].startOffset = 0;
    }

    //
    // For each transfer
    //
    for(i = 0; i < s32TransNum /*pvTransfer.size()*/; i++)
    {
        //
        // Sanity check
        //
        if(pvTransfer[i].byteCount == 0)
        {
            continue;
        }
        
        //
        // Set progress
        //
        //setProgress(addressToPage(pvTransfer[i].startAddr));

        //
        // Send download command
        //
        if((retCode = cmdDownload(pvTransfer[i].startAddr, 
                                  pvTransfer[i].byteCount)) != SBL_SUCCESS)
        {
            return retCode;
        }

        //
        // Check status after download command
        //
        retCode = readStatus(&devStatus);
        if(retCode != SBL_SUCCESS)
        {
            RFUP_PRINT("Error during download initialization. Failed to read device status after sending download command.\n");
            return retCode;
        }
        if(devStatus != CMD_RET_SUCCESS)
        {
            //setState(SBL_ERROR, "Error during download initialization. Device returned status %d (%s).\n", devStatus, getCmdStatusString(devStatus).c_str());
			RFUP_PRINT("read status error 11\n");
			return SBL_ERROR;
        }

        //
        // Send data in chunks
        //
        bytesLeft = pvTransfer[i].byteCount;
        dataIdx   = pvTransfer[i].startOffset;
        while(bytesLeft)
        {
            //
            // Set progress
            //
            //setProgress(addressToPage(ui32StartAddress + dataIdx));
            //setProgress( ((100*(++ui32CurrChunk))/ui32TotChunks) );

            //
            // Limit transfer count
            //
            bytesInTransfer = min(SBL_CC2650_MAX_BYTES_PER_TRANSFER, bytesLeft);

            //
            // Send Data command
            //
            retCode = cmdSendData(&pcData[dataIdx], bytesInTransfer);
            if(retCode != SBL_SUCCESS)
            {
            	#if 0
                setState(retCode, "Error during flash download. \n- Start address 0x%08X (page %d). \n- Tried to transfer %d bytes. \n- This was transfer %d.\n", 
                         (ui32StartAddress+dataIdx), 
                         addressToPage(ui32StartAddress+dataIdx),
                         bytesInTransfer, 
                         (transferNumber));
				#endif
				RFUP_PRINT("cmdSendData failed 11\n");
                return retCode;
            }

            if(pvTransfer[i].bExpectAck)
            {
                //
                // Check status after send data command
                //
                devStatus = 0;
                retCode = readStatus(&devStatus);
                if(retCode != SBL_SUCCESS)
                {
                	#if 0
                    setState(retCode, "Error during flash download. Failed to read device status.\n- Start address 0x%08X (page %d). \n- Tried to transfer %d bytes. \n- This was transfer %d in chunk %d.\n", 
                                 (ui32StartAddress+dataIdx), 
                                 addressToPage(ui32StartAddress + dataIdx),
                                 (bytesInTransfer), (transferNumber), 
                                 (i));
					#endif
					RFUP_PRINT("retCode != SBL_SUCCESS\n");
                    return retCode;
                }
                if(devStatus != CMD_RET_SUCCESS)
                {
                    //setState(SBL_SUCCESS, "Device returned status %s\n", getCmdStatusString(devStatus).c_str());
                    RFUP_PRINT("devStatus != CMD_RET_SUCCESS\n");
                    if(bIsRetry)
                    {
                        //
                        // We have failed a second time. Aborting.
                        #if 0
                        setState(SBL_ERROR, "Error retrying flash download.\n- Start address 0x%08X (page %d). \n- Tried to transfer %d bytes. \n- This was transfer %d in chunk %d.\n", 
                                 (ui32StartAddress+dataIdx), 
                                 addressToPage(ui32StartAddress + dataIdx),
                                 (bytesInTransfer), (transferNumber), 
                                 (i));
						#endif
						RFUP_PRINT("devStatus != CMD_RET_SUCCESS 11\n");
                        return SBL_ERROR;
                    }

                    //
                    // Retry to send data one more time.
                    //
                    bIsRetry = true;
                    continue;
                }
            }
            else
            {
                //
                // We're locking device and will lose access
                //
                m_bCommInitialized = false;
            }

            //
            // Update index and bytesLeft
            //
            bytesLeft -= bytesInTransfer;
            dataIdx += bytesInTransfer;
            transferNumber++;
            bIsRetry = false;
        }
    }

    return SBL_SUCCESS;
}

int vStartCC1310Upgrade()
{
	int s32Ret = 0;

	FILE *pFd = NULL;
	char *path = NULL;
	
	HI_U32 byteCount = 0;			// File size in bytes
    HI_U32 fileCrc, devCrc;		// Variables to save CRC checksum
	HI_U32 devFlashBase = 0;	    // Flash start address

	s32Ret = rfup_InitUart(1, 115200);
	if(s32Ret != 0)
	{
		RFUP_PRINT("vStartCC1310Upgrade: rfup_inituart fail\n");
		return -1;
	}

	pArrBuf = (char *)malloc(UPGRADE_ARR_SIZE * sizeof(char));
	if(pArrBuf == NULL)
	{
		RFUP_PRINT("malloc pArrBuf failed\n");
		return -1;
	}

	if(g_fw1->fwtype == VAVA_UPDATE_TYPE_RF)
	{
		path = UPDATE_FILE1;
	}
	else if(g_fw2->fwtype == VAVA_UPDATE_TYPE_RF)
	{
		path = UPDATE_FILE2;
	}

	if(path == NULL)
	{
		RFUP_PRINT("vStartCC1310Upgrade: [WARING] check type err\n");
		return -1;
	}

	pFd = fopen(path, "rb");
	if(pFd == NULL)
	{
		RFUP_PRINT("fopen %s failed\n", path);
		free(pArrBuf);
		return -1;
	}

