jerryxiee/linux-app/code/vava-2.0.1 T7/src/cc1310upgrade.c
	fseek(pFd, 0L, SEEK_END);  
    byteCount = ftell(pFd); 	
	fseek(pFd, 0L, SEEK_SET);
	
	char *buf = (char *)malloc(byteCount*sizeof(char));
	if(buf == NULL)
	{
		RFUP_PRINT("malloc buf failed\n");
		fclose(pFd);
		free(pArrBuf);
		return -1;
	}

	s32Ret = fread(buf,1,byteCount,pFd);
	if(s32Ret != byteCount)
	{
		free(buf);
		fclose(pFd);
		free(pArrBuf);
		return -1;
	}

	fclose(pFd);
	
    if(upgrade_connect(0, 115200, false) != SBL_SUCCESS) 
    {
    	free(buf);
		free(pArrBuf);
        return -1;
    }

	fileCrc = calcCrcLikeChip((unsigned char *)buf, 27*4096/*byteCount*/);
	RFUP_PRINT("Erasing flash ... devFlashBase = %d\n", devFlashBase);

	if(eraseFlashRange(devFlashBase, 27*4096/*byteCount*/) != SBL_SUCCESS)
    {
    	free(buf);
		RFUP_PRINT("Erasing flash Error\n");
		free(pArrBuf);
        return -1;
    }

    RFUP_PRINT("Writing flash ...\n");
    if(writeFlashRange(devFlashBase, 27*4096/*byteCount*/, buf) != SBL_SUCCESS)
    {
    	free(buf);
		RFUP_PRINT("Writing flash Error\n");
		free(pArrBuf);
        return -1;
    }

    RFUP_PRINT("Calculating CRC on device ...\n");
    if(calculateCrc32(devFlashBase, 27*4096/*byteCount*/, &devCrc) != SBL_SUCCESS)
    {
    	free(buf);
		RFUP_PRINT("Calculating CRC on device Error\n");
		free(pArrBuf);
		return -1;
    }

    RFUP_PRINT("Comparing CRC ...\n");
    if(fileCrc == devCrc) RFUP_PRINT("CRC OK\n");
    else RFUP_PRINT("CRC Mismatch!\n");

	//触发IO口接低 
	VAVAHAL_SystemCmd("echo 0 > /sys/devices/gpio-leds/leds/vava:orange:boot/brightness");

	sleep(2);

    RFUP_PRINT("Resetting device ...\n");
    if(reset() != SBL_SUCCESS)
    {
    	free(buf);
		RFUP_PRINT("Resetting device Error\n");
		free(pArrBuf);
        return -1;
    }
    RFUP_PRINT("Reset OK Upgrade finish\n");

	if(buf != NULL)
	{
		free(buf);
		buf = NULL;
	}
	
	free(pArrBuf);

	return 0;
}

